user/tutorials/Nike/ISAT_paper/2D_shock/shockDroplet_codestream_longer_C12test_D_2d_1C_low_T/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 500;

boundaryField
{
    wall
    {
        type            empty;
    }
    top
    {
        type            zeroGradient;
        //type            waveTransmissiveDF;
    }
    bottom
    {
        type            zeroGradient;
        //type            waveTransmissiveDF;
    }
    inlet
    {
        type            waveTransmissiveDF;
    }
    outlet
    {
        type            waveTransmissiveDF;
    }
}


// ************************************************************************* //
